{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "28", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "28", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "28", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu1_gamma", 
      "attr": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu", 
        "slope": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu1", 
      "attr": {
        "act_type": "prelu", 
        "slope": "0.0"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu2_gamma", 
      "attr": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu", 
        "slope": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu2", 
      "attr": {
        "act_type": "prelu", 
        "slope": "0.0"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_weight", 
      "attr": {
        "kernel": "(2, 2)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bias", 
      "attr": {
        "kernel": "(2, 2)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3", 
      "attr": {
        "kernel": "(2, 2)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu3_gamma", 
      "attr": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu", 
        "slope": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu3", 
      "attr": {
        "act_type": "prelu", 
        "slope": "0.0"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten_0", 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_weight", 
      "attr": {
        "no_bias": "False", 
        "num_hidden": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_bias", 
      "attr": {
        "no_bias": "False", 
        "num_hidden": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "conv4", 
      "attr": {
        "no_bias": "False", 
        "num_hidden": "128"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu4_gamma", 
      "attr": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu", 
        "slope": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu4", 
      "attr": {
        "act_type": "prelu", 
        "slope": "0.0"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_2_weight", 
      "attr": {
        "no_bias": "False", 
        "num_hidden": "4"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_2_bias", 
      "attr": {
        "no_bias": "False", 
        "num_hidden": "4"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "conv5_2", 
      "attr": {
        "no_bias": "False", 
        "num_hidden": "4"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_1_weight", 
      "attr": {
        "no_bias": "False", 
        "num_hidden": "2"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_1_bias", 
      "attr": {
        "no_bias": "False", 
        "num_hidden": "2"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "conv5_1", 
      "attr": {
        "no_bias": "False", 
        "num_hidden": "2"
      }, 
      "inputs": [[23, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prob1_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "prob1", 
      "inputs": [[29, 0, 0], [30, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    7, 
    8, 
    10, 
    13, 
    14, 
    16, 
    19, 
    20, 
    22, 
    24, 
    25, 
    27, 
    28, 
    30
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32
  ], 
  "heads": [[26, 0, 0], [31, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1001]}
}